---
type: IFCOpeningData
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 6
tags: [revit-api, class]
---

# IFCOpeningData

`Autodesk.Revit.DB.IFC.IFCOpeningData` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetExtrusionData | 2014 | `public IList < IFCExtrusionData > GetExtrusionData ()` |
| Method | GetOpeningSolids | 2014 | `public IList < Solid > GetOpeningSolids ()` |
| Property | IsRecess | 2014 | `public bool IsRecess { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | OpeningElementId | 2014 | `public ElementId OpeningElementId { get ; }` |